Repository: Dawid-Dlugosz/Primus
Catalog: lib/l10n/app_*.arb
Languages: pl

source: Hello World!
pl: Witaj Świecie!

source: Loading
pl: Ładowanie

# error
source: Ooops, Error occured
pl: Ooops, Wystąpił błąd

# mailHint
source: mail@example.com
pl: e-mail@domena.pl

# labelMail
source: Mail
pl: E-mail

# labelPassword
source: Password
pl: Hasło

source: Sign in
pl: Logowanie

source: Sign up
pl: Rejestracja

# mailError
source: Enter valid mail
pl: Podaj poprawny adres e-mail

# passwordError
source: Enter password
pl: Podaj hasło

source: Invalid email
pl: Nieprawidłowy e-mail

source: User disabled
pl: Użytkownik dezaktywowany

# userNotFount
source: User not found
pl: Nie znaleziono użytkownika

source: Wrong password
pl: Błędne hasło

source: Email already exist
pl: Taki e-mail już istnieje

source: Invalid credential
pl: Nieprawidłowe dane

source: Weak password
pl: Hasło jest za słabe

# labelName
source: Nickname
pl: Nazwa użytkownika

# nickNameError
source: Enter nickname
pl: Podaj nazwę użytkownika

# nicknameBusy
source: Nickname is busy
pl: Nazwa użytkownika jest zajęta

source: Create flashcards
pl: Utwórz fiszki

source: Create unit
pl: Utwórz rozdział

source: Create class
pl: Utwórz klasę

source: Flashcards
pl: Fiszki

source: Flashcards name
pl: Nazwa fiszek

# flashcardsNameError
source: Enter flashcards name
pl: Podaj nazwę fiszek

# wordHint
source: Enter word
pl: Podaj słowo

# definitionHint
source: Enter definition
pl: Podaj definicję

# flashcardNameBusy
source: You have already created a card with that name
pl: Stowrzyłeś już fiszkę o takiej nazwie

# flashcardCreate
source: Flashcard created
pl: Fiszki zostały stworzone

# flashcardListEmpty
source: You must add at least one card
pl: Musisz dodać conajmniej jedą fiszkę

# flashcardLanguageError
source: Enter language
pl: Podaj język

# flashcardsLanguage
source: Input language
pl: Wprowadź języ

# nameFlashcardSet
source: Flashcard set name: {name}
pl: Nazwa zestawu fiszek: {name}

# flashCardWordsCount
source: Words count: {count}
pl: Liczba słów: {count}

# showMore
source: Show all
pl: Pokaż wszystkie

# lastUpdate
source: Last update: {date}
pl: Ostatnia aktualizacja: {date}

source: Definition
pl: Definicja

# language
source: Language: {lang}
pl: Język: {lang}

# author
source: Author: {author}
pl: Autor: {author}

# learnedWord
source: Learned words
pl: Poznane słowa

# unknowWord
source: UnknowWord words
pl: Nieznane słowa

# swiperEmpty
source: It looks like there's nothing here, you need to learn a few words ;)
pl: Wygląda na to, że nic tu nie ma, musisz nauczyć się paru słówek ;)

source: Spelling
pl: Pisownia

# learnModeFlashcard
source: Learn Mode: Flashcards
pl: Tryb uczenia się: Fiszki

# copyFlashcard
source: Are you sure you want to copy the set to yourself?
pl: Czy na pewno chcesz skopiować zestaw do siebie?

source: Yes
pl: Tak

source: No
pl: Nie

# copied
source: You have already copied this set
pl: Skopiowałeś już ten zestaw

# flashcardShort
source: Flashcard Set is too short, min 4
pl: Zestaw jest za krótki, min. 4

source: Flashcard updated
pl: Zaktualizowano zestaw

# flashcardDelete
source: Do you want to delete the set?
pl: Czy chcesz usunać zestaw?

source: Edit
pl: Edytuj

source: Delete
pl: Usuń

# duringStudy
source: During studying
pl: W trakcie nauki

# def
source: Definition: {definition}
pl: Definicja: {definition}

# toLearnDelete
source: Are you sure you want delete the study set?
pl: Czy na pewno chcesz usunać zestaw do nauki?

source: To study
pl: Do nauki

source: All sets
pl: Wszystkie zestawy

# enterNameUnit
source: Enter unit name
pl: Podaj nazwę rozdziału

source: Save
pl: Zapisz

# selectSets
source: Select sets to unit
pl: Wybierz zestawy do folderu

source: Name is busy
pl: Nazwa jest zajęta

# createdUnit
source: Unit created
pl: Folder utworzony

source: Units
pl: Foldery

# setsCount
source: Sets count: {count}
pl: Liczba zestawów: {count}

source: Unit: {name}
pl: Folder: {name}

# unitDelete
source: Do you want to delete the unit?
pl: Czy chcesz usunąć Folder?

source: Edit success
pl: Edycja udana
